//
//  NSError+MisError.h
//  TaiYiToken
//
//  Created by 张元一 on 2018/11/7.
//  Copyright © 2018 admin. All rights reserved.
//

#import <Foundation/Foundation.h>

NS_ASSUME_NONNULL_BEGIN

@interface NSError (MisError)
+(NSError *)ErrorWithTitle:(NSString *)descstr Code:(NSInteger)errcode;
@end
/*
 102000 @“钱包已存在!”
 
 102100 @“keystore生成错误"
 102101 @"助记词错误"
 
 102500  @"UTXO为0"
 102501  @"转账金额太小"
 102502 @"没有匹配的私钥"
 102503 @“hash生成错误"
 102504 @"交易不能在signatureHashForScript中更改!"
 102505 @"签名无效!"
 102506 @“需要验证第一笔输出”
 
 102700 @"账户信息获取失败，请稍后再试"
 102701 @"行情列表数据获取失败"
 102702 @"初始化信息获取失败"
 102703 @"获取收益额失败"
 102704 @"排行榜获取失败"
 102705 @"综合市场获取失败"
 102706 @"板块列表获取失败"
 102707 @"汇率获取失败"
 102708 @"币种信息获取失败"
 102709 @"委买委卖列表获取失败"
 102710 @"项目介绍获取失败"
 102711 @"获取所有交易对失败"
 102712 @"创建MIS钱包失败"
 102713 @"人脸识别接口错误，请稍后再试"
 102714 @"修改密码失败"
 102715 @"重置密码失败
 102716 @"绑定邮箱失败"
 102717 @"绑定手机失败"
 102718 @"验证码发送失败"
 102719 @"登录失败"
 102720 @"注册失败"
 102800 @"账户信息查询失败，请稍后再试"
 102801 @"市值列表获取失败"
 102802 @"自选列表获取失败"
 102803  @“交易数据统计信息上传失败”
 102804 @"人脸识别接口错误，请稍后再试"
 
 102900 @"比特币美元汇率错误"
 102901 @"BTC查询余额错误"
 102902 @"BTC获取交易列表错误"
 102903 @"BTC获取交易详情错误"
 102904 @"获取UTXO错误"
 102905 @"BTC交易广播失败"
 102906 @"余额不足"
 
 
 
 102910 @"ETH交易记录状态查询失败"
 102911 @"USDT余额查询错误"
 */
NS_ASSUME_NONNULL_END
